app/views/users/show.html.erb

SELECT "broments".* FROM "broments" ORDER BY broments.created_at DESC
---
      <strong>URL</strong>  <%= link_to @user.loginId + "'s page", @user %>
      <strong>Broments</strong> <%= @user.broments.count %>