app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "broments" WHERE ("broments".user_id = 37)
---
    <p class="broments">
      <%= pluralize(current_user.broments.count, "broment") %>