app/controllers/broments_controller.rb

  def create
    @broment  = current_user.broments.build(params[:broment])
    if @broment.save
---
INSERT INTO "broments" ("content", "user_id", "created_at", "updated_at") VALUES ('superlongmicrosofWERDsuperlongmicrosofWERDsuperlongmicrosofWERDsuperlongmicrosofWERDsuperlongmicrosofWERDsuperlongmicrosofWERD

  def destroy
    @broment.destroy
---
DELETE FROM "broments" WHERE "broments"."id" = 302