app/controllers/entries_controller.rb

  def edit
    @entry = Entry.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = 1 LIMIT 1

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("name", "bio", "quote", "origin", "birth", "created_at", "updated_at") VALUES ('Leonardbro Dicrapribro', 'Star of titanic, catch me if you can, gangs of new york, INCEPTION, etc', 'Ill never leave you, rose... (drowns immediately afterwards)', 'Hollywood, CA', '2006-11-11', '2011-04-16 20:41:06.652971', '2011-04-16 20:41:06.652971')

  def update
    @entry = Entry.find(params[:id])

    respond_to do |format|
      if @entry.update_attributes(params[:entry])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = 1 LIMIT 1
UPDATE "entries" SET "photo_file_name" = 'joseph-stalin-7.gif', "photo_content_type" = 'image/gif', "photo_file_size" = 57740, "photo_updated_at" = '2011-04-16 21:26:00.018808', "updated_at" = '2011-04-16 21:26:00.020532' WHERE "entries"."id" = 1