app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (name like '%%') ORDER BY name LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE (name like '%%')
---
  def index
    @title = "Fellow Bros"
    @users = User.search(params[:search], params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "broments".* FROM "broments" WHERE ("broments".user_id = 37) ORDER BY broments.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "broments" WHERE ("broments".user_id = 37)
---
  def show
    @user = User.find(params[:id])
    # Uncomment next part to do something like /username isntead of /users/1
    # if params[:loginId]
#     	@user = User.where(:loginId => params[:loginId]).first
#     	@broments = @user.broments
#     else
#     	@broments = Broment.all
#     end
    @broments = @user.broments.paginate(:page => params[:page])

INSERT INTO "users" ("name", "email", "loginId", "fistPumps", "created_at", "updated_at", "encrypted_password", "salt", "admin") VALUES ('DANIEL SUN', 'dansun@example.com', 'dansun', NULL, '2011-05-04 02:59:35.535004', '2011-05-04 02:59:35.535004', '06ea89a206966b011130ba7f485de4dce2d738ebde8322c5495c82252d69fc67', '395c92ae11678016f4ab32e3047b80bd5feec9fd6f892b156cdd1e0d68af4117', NULL)
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "name" = 'New Name', "email" = 'user@example.org', "encrypted_password" = '4884bab9da4af123903ab308b350067d4d61d4968ddfc410726d8aa8bcb3a95f', "updated_at" = '2011-04-22 06:13:21.951590' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 3
---
  def destroy
    @user = User.find(params[:id])
    if(!@user.admin?)
    	User.find(params[:id]).destroy